{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Condition_task.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "В офисе, где работает программист Петр, установили кондиционер нового типа. Этот кондиционер отличается особой простотой в управлении. У кондиционера есть всего лишь два управляемых параметра: желаемая температура и режим работы.\n",
        "\n",
        "Кондиционер может работать в следующих четырех режимах:\n",
        "\n",
        "«freeze» — охлаждение. В этом режиме кондиционер может только уменьшать температуру. Если температура в комнате и так не больше желаемой, то он выключается.\n",
        "\n",
        "«heat» — нагрев. В этом режиме кондиционер может только увеличивать температуру. Если температура в комнате и так не меньше желаемой, то он выключается.\n",
        "\n",
        "«auto» — автоматический режим. В этом режиме кондиционер может как увеличивать, так и уменьшать температуру в комнате до желаемой.\n",
        "\n",
        "«fan» — вентиляция. В этом режиме кондиционер осуществляет только вентиляцию воздуха и не изменяет температуру в комнате.\n",
        "\n",
        "Кондиционер достаточно мощный, поэтому при настройке на правильный режим работы он за час доводит температуру в комнате до желаемой.\n",
        "\n",
        "Требуется написать программу, которая по заданной температуре в комнате troom, установленным на кондиционере желаемой температуре tcond и режиму работы определяет температуру, которая установится в комнате через час.\n",
        "\n",
        "Формат ввода\n",
        "\n",
        "Первая строка входного файла содержит два целых числа troom, и tcond, разделенных ровно одним пробелом (–50 ≤ troom ≤ 50, –50 ≤ tcond ≤ 50).\n",
        "\n",
        "Вторая строка содержит одно слово, записанное строчными буквами латинского алфавита — режим работы кондиционера.\n",
        "\n",
        "Формат вывода\n",
        "\n",
        "Выходной файл должен содержать одно целое число — температуру, которая установится в комнате через час."
      ],
      "metadata": {
        "id": "wdjAuTiJNLJ-"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 10,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "jB7D8-g7NE6S",
        "outputId": "193fc943-fffb-44e2-f20a-49a1a419e5c7"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "-10 30\n",
            "fan\n",
            "-10\n"
          ]
        }
      ],
      "source": [
        "def cond_work(t_room:int, t_cond:int,cond_mode:str):\n",
        "    if cond_mode == \"auto\":\n",
        "        return t_cond\n",
        "    if cond_mode == \"freeze\" and t_cond < t_room:\n",
        "        return t_cond\n",
        "    if cond_mode == \"heat\" and t_cond > t_room:\n",
        "        return t_cond\n",
        "    return t_room\n",
        "\n",
        "\n",
        "t_room, t_cond = map(int, input().split())\n",
        "cond_mode = input()\n",
        "print(cond_work(t_room, t_cond,cond_mode))\n"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        ""
      ],
      "metadata": {
        "id": "LO1xEFmXP70S"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}